# TUGAS
# Pengenalan Dasar Library Pandas

Kelompok

1. Azmi

2. Farras

3. Hirzan

4. Ryan

5. Surahmat

In [ ]:
# import libraries
import pandas as pd

In [ ]:
# Membuat array "df" satu dimensi dengan Pandas
# nilainya [1,3,4,5]
df = pd.Series([1, 3, 4, 5])

# Membuat dataframe dengan nilai berikut:
# 'Nama' : ['Andi', 'Budi', 'Dodo', 'Ema', 'Kari']
# 'Nilai' : [80, 20, 90, 40, 55]
# 'Kelas' : ['3B', '3A', '3B', '3B', '3A']
data = {
    'Nama': ['Andi', 'Budi', 'Dodo', 'Ema', 'Kari'],
    'Nilai': [80, 20, 90, 40, 55],
    'Kelas': ['3B', '3A', '3B', '3B', '3A']
}
df_dataframe = pd.DataFrame(data)

# Print seluruh baris pada kolom Nama
print("Seluruh baris pada kolom Nama:")
print(df_dataframe['Nama'])

# Sortir data berdasarkan Nilai tertinggi ke Nilai terendah
df_dataframe_sorted = df_dataframe.sort_values(by='Nilai', ascending=False)

print("\nDataframe setelah diurutkan berdasarkan Nilai tertinggi:")
print(df_dataframe_sorted)

Seluruh baris pada kolom Nama:
0    Andi
1    Budi
2    Dodo
3     Ema
4    Kari
Name: Nama, dtype: object

Dataframe setelah diurutkan berdasarkan Nilai tertinggi:
   Nama  Nilai Kelas
2  Dodo     90    3B
0  Andi     80    3B
4  Kari     55    3A
3   Ema     40    3B
1  Budi     20    3A

# Bermain dengan Real Data
1. Download data dari link berikut: https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries/

2. Save ds_salaries.csv pada Google Drive

In [14]:
# load data ds_salaries.csv dengan nama variabel "df"
df = pd.read_csv('ds_salaries.csv')

In [15]:
# Print 5 baris teratas
print("5 Baris Teratas:")
print(df.head())

# print 5 baris terakhir
print("\n5 Baris Terakhir:")
print(df.tail())

5 Baris Teratas:
   Unnamed: 0  work_year experience_level employment_type  \
0           0       2020               MI              FT
1           1       2020               SE              FT
2           2       2020               SE              FT
3           3       2020               MI              FT
4           4       2020               SE              FT

                    job_title  salary salary_currency  salary_in_usd  \
0              Data Scientist   70000             EUR          79833
1  Machine Learning Scientist  260000             USD         260000
2           Big Data Engineer   85000             GBP         109024
3        Product Data Analyst   20000             USD          20000
4   Machine Learning Engineer  150000             USD         150000

  employee_residence  remote_ratio company_location company_size
0                 DE             0               DE            L
1                 JP             0               JP            S
2                 GB            50               GB            M
3                 HN             0               HN            S
4                 US            50               US            L

5 Baris Terakhir:
     Unnamed: 0  work_year experience_level employment_type      job_title  \
602         602       2022               SE              FT  Data Engineer
603         603       2022               SE              FT  Data Engineer
604         604       2022               SE              FT   Data Analyst
605         605       2022               SE              FT   Data Analyst
606         606       2022               MI              FT   AI Scientist

     salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
602  154000             USD         154000                 US           100
603  126000             USD         126000                 US           100
604  129000             USD         129000                 US             0
605  150000             USD         150000                 US           100
606  200000             USD         200000                 IN           100

    company_location company_size
602               US            M
603               US            M
604               US            M
605               US            M
606               US            L

In [16]:
# Print nama kolom
print("Nama Kolom:")
print(df.columns)

Nama Kolom:
Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [17]:
# Tampilkan data baris ke 5-10 pada
print("Data dari Baris ke-5 hingga ke-10:")
print(df.iloc[4:10])

# Tampilkan data baris ke 5-10 pada kolom job_title dan company_location
selected_columns = ['job_title', 'company_location']
print("Data dari Baris ke-5 hingga ke-10 pada Kolom job_title dan company_location:")
print(df.loc[4:9, selected_columns])

Data dari Baris ke-5 hingga ke-10:
   Unnamed: 0  work_year experience_level employment_type  \
4           4       2020               SE              FT
5           5       2020               EN              FT
6           6       2020               SE              FT
7           7       2020               MI              FT
8           8       2020               MI              FT
9           9       2020               SE              FT

                   job_title    salary salary_currency  salary_in_usd  \
4  Machine Learning Engineer    150000             USD         150000
5               Data Analyst     72000             USD          72000
6        Lead Data Scientist    190000             USD         190000
7             Data Scientist  11000000             HUF          35735
8      Business Data Analyst    135000             USD         135000
9         Lead Data Engineer    125000             USD         125000

  employee_residence  remote_ratio company_location company_size
4                 US            50               US            L
5                 US           100               US            L
6                 US           100               US            S
7                 HU            50               HU            L
8                 US           100               US            L
9                 NZ            50               NZ            S
Data dari Baris ke-5 hingga ke-10 pada Kolom job_title dan company_location:
                   job_title company_location
4  Machine Learning Engineer               US
5               Data Analyst               US
6        Lead Data Scientist               US
7             Data Scientist               HU
8      Business Data Analyst               US
9         Lead Data Engineer               NZ

In [24]:
# Hitung rata-rata salary_in_usd
print(f"Rata-rata Salary in USD: {average_salary}")

NameError: ignored

In [25]:
# Simpan data baris ke 5-20 ke bentuk .csv dengan nama "sparse.csv"
selected_rows = df.loc[4:19]
selected_rows.to_csv('sparse.csv', index=False)